; domain
(define (domain emergency)
  (:requirements :strips :typing)

  (:types
    drone
    person
    crate
    location
    content
    arm
  )

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)

    (arm-of ?a - arm ?d - drone)
    (free ?a - arm)
    (holding ?a - arm ?c - crate)

    (crate-has ?c - crate ?t - content)
    (person-has ?p - person ?t - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and
      (not (at-drone ?d ?from))
      (at-drone ?d ?to)
    )
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and
      (at-drone ?d ?l)
      (at-crate ?c ?l)
      (arm-of ?a ?d)
      (free ?a)
    )
    :effect (and
      (not (at-crate ?c ?l))
      (not (free ?a))
      (holding ?a ?c)
    )
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?t - content)
    :precondition (and
      (at-drone ?d ?l)
      (at-person ?p ?l)
      (arm-of ?a ?d)
      (holding ?a ?c)
      (crate-has ?c ?t)
    )
    :effect (and
      (person-has ?p ?t)
      (free ?a)
      (not (holding ?a ?c))
    )
  )

)

; problem
(define (problem emergency_d1_l7_p7_c7_g7)
(:domain emergency)
(:objects
	drone1 - drone
	drone1_arm1 - arm
	drone1_arm2 - arm
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
)
(:init
	(at-drone drone1 depot)
	(arm-of drone1_arm1 drone1)
	(arm-of drone1_arm2 drone1)
	(free drone1_arm1)
	(free drone1_arm2)
	(at-crate crate1 depot)
	(at-crate crate2 depot)
	(at-crate crate3 depot)
	(at-crate crate4 depot)
	(at-crate crate5 depot)
	(at-crate crate6 depot)
	(at-crate crate7 depot)
	(crate-has crate1 food)
	(crate-has crate2 food)
	(crate-has crate3 food)
	(crate-has crate4 medicine)
	(crate-has crate5 medicine)
	(crate-has crate6 medicine)
	(crate-has crate7 medicine)
	(at-person person1 loc6)
	(at-person person2 loc1)
	(at-person person3 loc3)
	(at-person person4 loc3)
	(at-person person5 loc4)
	(at-person person6 loc5)
	(at-person person7 loc5)
)
(:goal (and
	(at-drone drone1 depot)
	(person-has person1 medicine)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person3 medicine)
	(person-has person6 food)
	(person-has person6 medicine)
))
)

; plan
1. (pick-up drone1 drone1_arm1 crate3 depot)
   deleted: (at-crate crate3 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate3)
   goals met: 1 of 8
2. (pick-up drone1 drone1_arm2 crate5 depot)
   deleted: (at-crate crate5 depot) (free drone1_arm2)
   added: (holding drone1_arm2 crate5)
   goals met: 1 of 8
3. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 0 of 8
4. (deliver drone1 drone1_arm1 crate3 person6 loc5 food)
   deleted: (holding drone1_arm1 crate3)
   added: (person-has person6 food) (free drone1_arm1)
   goals met: 1 of 8
5. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 2 of 8
6. (pick-up drone1 drone1_arm1 crate2 depot)
   deleted: (at-crate crate2 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate2)
   goals met: 2 of 8
7. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 1 of 8
8. (deliver drone1 drone1_arm1 crate2 person3 loc3 food)
   deleted: (holding drone1_arm1 crate2)
   added: (person-has person3 food) (free drone1_arm1)
   goals met: 2 of 8
9. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 3 of 8
10. (pick-up drone1 drone1_arm1 crate1 depot)
   deleted: (at-crate crate1 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate1)
   goals met: 3 of 8
11. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 2 of 8
12. (deliver drone1 drone1_arm1 crate1 person2 loc1 food)
   deleted: (holding drone1_arm1 crate1)
   added: (person-has person2 food) (free drone1_arm1)
   goals met: 3 of 8
13. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 4 of 8
14. (pick-up drone1 drone1_arm1 crate4 depot)
   deleted: (at-crate crate4 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate4)
   goals met: 4 of 8
15. (fly drone1 depot loc5)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc5)
   goals met: 3 of 8
16. (deliver drone1 drone1_arm1 crate4 person6 loc5 medicine)
   deleted: (holding drone1_arm1 crate4)
   added: (person-has person6 medicine) (free drone1_arm1)
   goals met: 4 of 8
17. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 5 of 8
18. (pick-up drone1 drone1_arm1 crate7 depot)
   deleted: (at-crate crate7 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate7)
   goals met: 5 of 8
19. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 4 of 8
20. (deliver drone1 drone1_arm1 crate7 person3 loc3 medicine)
   deleted: (holding drone1_arm1 crate7)
   added: (person-has person3 medicine) (free drone1_arm1)
   goals met: 5 of 8
21. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 6 of 8
22. (pick-up drone1 drone1_arm1 crate6 depot)
   deleted: (at-crate crate6 depot) (free drone1_arm1)
   added: (holding drone1_arm1 crate6)
   goals met: 6 of 8
23. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 5 of 8
24. (deliver drone1 drone1_arm1 crate6 person1 loc6 medicine)
   deleted: (holding drone1_arm1 crate6)
   added: (person-has person1 medicine) (free drone1_arm1)
   goals met: 6 of 8
25. (fly drone1 loc6 loc1)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 loc1)
   goals met: 6 of 8
26. (deliver drone1 drone1_arm2 crate5 person2 loc1 medicine)
   deleted: (holding drone1_arm2 crate5)
   added: (person-has person2 medicine) (free drone1_arm2)
   goals met: 7 of 8
27. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 8 of 8
